package Comon.Security;

public interface Protocols {

    public boolean authentication();
    /*
    * 1. клієнт викликає протокол аунтификації
    * 2. клієнт вводить логін та відправляє на сервер
    * 3. сервер шукає запис с логіном та відправляє сіль
    * 4. клієнт вводить пароль та шифрує за допомогою сілі та відправляє на сервер
    * 5. сервер перевіряє результат шифрування клієнта з записом в бд
    * 6. сервер відпрявляє відповідь
     */

    public boolean restorePassword();

    public boolean changePassword();

    public boolean registration();
    /*
    * 1. клієнт викликає протокол регестрації
    * 2. клієнт вводить логін та відправляє серверу
    * 3. сервер перевіряє чи нема що нема в бд запису с таким логіном
    * 4. сервер передає відповідь
    * 5. якщо є то клієнт переносится на крок 2 та видоми повідомлення
    * 6. сервер генерує та відправляє сіль
    * 7. клієнт придумує пароль, шифрує і відправляє на сервер
    * 8.сервер зберігає: логін, пароль, сіль
    * */
}